(function() {

	var where = [{
		loca: '北京市',
		locaCode: '110000',
		locaCity: ['市辖区', '县'],
		locaCityCode: ['110100', '110200'],
		locaCityArea: ['东城区', '西城区', '朝阳区', '丰台区', '石景山区', '海淀区', '门头沟区', '房山区', '通州区', '顺义区', '昌平区', '大兴区', '怀柔区', '平谷区', '密云县', '延庆县'],
		locaCityAreaCode: ['110101', '110102', '110105', '110106', '110107', '110108', '110109', '110111', '110112', '110113', '110114', '110115', '110116', '110117', '110228', '110229']
	}, {
		loca: '河北省',
		locaCode: '130000',
		locaCity: ['石家庄市', '唐山市', '秦皇岛市', '邯郸市', '邢台市', '保定市', '张家口市', '承德市', '沧州市', '廊坊市', '衡水市'],
		locaCityCode: ['130100', '130200', '130300', '130400', '130500', '130600', '130700', '130800', '130900', '131000', '131100'],
		locaCityArea: [
			['市辖区', '长安区', '桥东区', '桥西区', '新华区', '井陉矿区', '裕华区', '井陉县', '正定县', '栾城县', '行唐县', '灵寿县', '高邑县', '深泽县', '赞皇县', '无极县', '平山县', '元氏县', '赵县', '辛集市', '藁城市', '晋州市', '新乐市', '鹿泉市'],
			['市辖区', '路南区', '路北区', '古冶区', '开平区', '丰南区', '丰润区', '滦县', '滦南县', '乐亭县', '迁西县', '玉田县', '唐海县', '遵化市', '迁安市'],
			['市辖区', '海港区', '山海关区', '北戴河区', '青龙满族自治县', '昌黎县', '抚宁县', '卢龙县'],
			['市辖区', '邯山区', '丛台区', '复兴区', '峰峰矿区', '县', '临漳县', '成安县', '大名县', '涉县', '磁县', '肥乡县', '永年县', '邱县', '鸡泽县', '广平县', '馆陶县', '魏县', '曲周县', '武安市'],
			['市辖区', '桥东区', '桥西区', '县', '临城县', '内丘县', '柏乡县', '隆尧县', '任县', '南和县', '宁晋县', '巨鹿县', '新河县', '广宗县', '平乡县', '威县', '清河县', '临西县', '南宫市', '沙河市'],
			['市辖区', '新市区', '北市区', '南市区', '满城县', '清苑县', '涞水县', '阜平县', '徐水县', '定兴县', '唐县', '高阳县', '容城县', '涞源县', '望都县', '安新县', '易县', '曲阳县', '蠡县', '顺平县', '博野县', '雄县', '涿州市', '定州市', '安国市', '高碑店市'],
			['市辖区', '桥东区', '桥西区', '宣化区', '下花园区', '宣化县', '张北县', '康保县', '沽源县', '尚义县', '蔚县', '阳原县', '怀安县', '万全县', '怀来县', '涿鹿县', '赤城县', '崇礼县'],
			['市辖区', '双桥区', '双滦区', '鹰手营子矿区', '县', '兴隆县', '平泉县', '滦平县', '隆化县', '丰宁满族自治县', '宽城满族自治县', '围场满族蒙古族自治县'],
			['市辖区', '新华区', '运河区', '沧县', '青县', '东光县', '海兴县', '盐山县', '肃宁县', '南皮县', '吴桥县', '献县', '孟村回族自治县', '泊头市', '任丘市', '黄骅市', '河间市'],
			['市辖区', '安次区', '广阳区', '固安县', '永清县', '香河县', '大城县', '文安县', '大厂回族自治县', '霸州市', '三河市'],
			['市辖区', '桃城区', '枣强县', '武邑县', '武强县', '饶阳县', '安平县', '故城县', '景县', '阜城县', '冀州市', '深州市']
		],
		locaCityAreaCode: [
			['130101', '130102', '130103', '130104', '130105', '130107', '130108', '130121', '130123', '130124', '130125', '130126', '130127', '130128', '130129', '130130', '130131', '130132', '130133', '130181', '130182', '130183', '130184', '130185'],
			['130201', '130202', '130203', '130204', '130205', '130207', '130208', '130223', '130224', '130225', '130227', '130229', '130230', '130281', '130283'],
			['130301', '130302', '130303', '130304', '130321', '130322', '130323', '130324'],
			['130401', '130402', '130403', '130404', '130406', '130421', '130423', '130424', '130425', '130426', '130427', '130428', '130429', '130430', '130431', '130432', '130433', '130434', '130435', '130481'],
			['130501', '130502', '130503', '130521', '130522', '130523', '130524', '130525', '130526', '130527', '130528', '130529', '130530', '130531', '130532', '130533', '130534', '130535', '130581', '130582'],
			['130601', '130602', '130603', '130604', '130621', '130622', '130623', '130624', '130625', '130626', '130627', '130628', '130629', '130630', '130631', '130632', '130633', '130634', '130635', '130636', '130637', '130638', '130681', '130682', '130683', '130684'],
			['130701', '130702', '130703', '130705', '130706', '130721', '130722', '130723', '130724', '130725', '130726', '130727', '130728', '130729', '130730', '130731', '130732', '130733'],
			['130801', '130802', '130803', '130804', '130821', '130822', '130823', '130824', '130825', '130826', '130827', '130828'],
			['130901', '130902', '130903', '130921', '130922', '130923', '130924', '130925', '130926', '130927', '130928', '130929', '130930', '130981', '130982', '130983', '130984'],
			['131001', '131002', '131003', '131022', '131023', '131024', '131025', '131026', '131028', '131081', '131082'],
			['131101', '131102', '131121', '131122', '131123', '131124', '131125', '131126', '131127', '131128', '131181', '131182']
		]
	}, {
		loca: '辽宁省',
		locaCode: '210000',
		locaCity: ['沈阳市', '大连市', '鞍山市', '抚顺市', '本溪市', '丹东市', '锦州市', '营口市', '阜新市', '辽阳市', '盘锦市', '铁岭市', '朝阳市', '葫芦岛市'],
		locaCityCode: ['210100', '210200', '210300', '210400', '210500', '210600', '210700', '210800', '210900', '211000', '211100', '211200', '211300', '211400'],
		locaCityArea: [
			['市辖区', '和平区', '沈河区', '大东区', '皇姑区', '铁西区', '苏家屯区', '东陵区', '新城子区', '于洪区', '辽中县', '康平县', '法库县', '新民市'],
			['市辖区', '中山区', '西岗区', '沙河口区', '甘井子区', '旅顺口区', '金州区', '长海县', '瓦房店市', '普兰店市', '庄河市'],
			['辖市', '铁东区', '铁西区', '立山区', '千山区', '台安县', '岫岩满族自治县', '海城市'],
			['市辖区', '新抚区', '东洲区', '望花区', '顺城区', '县', '新宾满族自治县', '清原满族自治县'],
			['市辖区', '平山区', '溪湖区', '明山区', '南芬区', '满族自治县', '桓仁满族自治县'],
			['市辖区', '元宝区', '振兴区', '振安区', '宽甸满族自治县', '东港市', '凤城市'],
			['市辖区', '古塔区', '凌河区', '太和区', '黑山县', '义县', '凌海市', '北宁市'],
			['市辖区', '站前区', '西市区', '鲅鱼圈区', '老边区', '盖州市', '大石桥市'],
			['市辖区', '海州区', '新邱区', '太平区', '清河门区', '细河区', '蒙古族自治县', '彰武县'],
			['市辖区', '白塔区', '文圣区', '宏伟区', '弓长岭区', '太子河区', '县', '灯塔市'],
			['市辖区', '双台子区', '兴隆台区', '大洼县', '盘山县'],
			['市辖区', '银州区', '清河区', '县', '西丰县', '昌图县', '调兵山市', '开原市'],
			['市辖区', '双塔区', '龙城区', '县', '建平县', '喀喇沁左翼蒙古自治县', '北票市', '凌源市'],
			['市辖区', '连山区', '龙港区', '南票区', '绥中县', '建昌县', '兴城市']
		],
		locaCityAreaCode: [
			['210101', '210102', '210103', '210104', '210105', '210106', '210111', '210112', '210113', '210114', '210122', '210123', '210124', '210181'],
			['210201', '210202', '210203', '210204', '210211', '210212', '210213', '210224', '210281', '210282', '210283'],
			['210301', '210302', '210303', '210304', '210311', '210321', '210323', '210381'],
			['210401', '210402', '210403', '210404', '210411', '210421', '210422', '210423'],
			['210501', '210502', '210503', '210504', '210505', '210521', '210522'],
			['210601', '210602', '210603', '210604', '210624', '210681', '210682'],
			['210701', '210702', '210703', '210711', '210726', '210727', '210781', '210782'],
			['210801', '210802', '210803', '210804', '210811', '210881', '210882'],
			['210901', '210902', '210903', '210904', '210905', '210911', '210921', '210922'],
			['211001', '211002', '211003', '211004', '211005', '211011', '211021', '211081'],
			['211101', '211102', '211103', '211121', '211122'],
			['211201', '211202', '211204', '211221', '211223', '211224', '211281', '211282'],
			['211301', '211302', '211303', '211321', '211322', '211324', '211381', '211382'],
			['211401', '211402', '211403', '211404', '211421', '211422', '211481']
		]
	}, {
		loca: '黑龙江省',
		locaCode: '230000',
		locaCity: ['哈尔滨市', '齐齐哈尔市', '鸡西市', '鹤岗市', '双鸭山市', '大庆市', '伊春市', '佳木斯市', '七台河市', '牡丹江市', '黑河市', '绥化市', '大兴安岭地区'],
		locaCityCode: ['230100', '230200', '230300', '230400', '230500', '230600', '230700', '230800', '230900', '231000', '231100', '231200', '232700'],
		locaCityArea: [
			['市辖区', '道里区', '南岗区', '道外区', '香坊区', '动力区', '平房区', '松北区', '呼兰区', '依兰县', '方正县', '宾县', '巴彦县', '木兰县', '通河县', '延寿县', '阿城市', '双城市', '尚志市', '五常市'],
			['市辖区', '龙沙区', '建华区', '铁锋区', '昂昂溪区', '富拉尔基区', '碾子山区', '梅里斯达斡尔族区', '龙江县', '依安县', '泰来县', '甘南县', '富裕县', '克山县', '克东县', '拜泉县', '讷河市'],
			['市辖区', '鸡冠区', '恒山区', '滴道区', '梨树区', '城子河区', '麻山区', '鸡东县', '虎林市', '密山市'],
			['市辖区', '向阳区', '工农区', '南山区', '兴安区', '东山区', '兴山区', '萝北县', '绥滨县'],
			['市辖区', '尖山区', '岭东区', '四方台区', '宝山区', '集贤县', '友谊县', '宝清县', '饶河县'],
			['市辖区', '萨尔图区', '龙凤区', '让胡路区', '红岗区', '大同区', '肇州县', '肇源县', '林甸县', '杜尔伯特蒙古族自治县'],
			['市辖区', '区', '南岔区', '友好区', '西林区', '翠峦区', '新青区', '美溪区', '金山屯区', '五营区', '乌马河区', '汤旺河区', '带岭区', '乌伊岭区', '红星区', '上甘岭区', '嘉荫县', '铁力市'],
			['市辖区', '永红区', '向阳区', '前进区', '东风区', '郊区', '桦南县', '桦川县', '汤原县', '抚远县', '同江市', '富锦市'],
			['市辖区', '新兴区', '桃山区', '茄子河区', '勃利县'],
			['市辖区', '东安区', '阳明区', '爱民区', '西安区', '东宁县', '林口县', '绥芬河市', '海林市', '宁安市', '穆棱市'],
			['市辖区', '爱辉区', '嫩江县', '逊克县', '孙吴县', '北安市', '五大连池市'],
			['市辖区', '北林区', '望奎县', '兰西县', '青冈县', '庆安县', '明水县', '绥棱县', '安达市', '肇东市', '海伦市'],
			['呼玛县', '塔河县', '漠河县']
		],
		locaCityAreaCode: [
			['230101', '230102', '230103', '230104', '230106', '230107', '230108', '230109', '230111', '230123', '230124', '230125', '230126', '230127', '230128', '230129', '230181', '230182', '230183', '230184'],
			['230201', '230202', '230203', '230204', '230205', '230206', '230207', '230208', '230221', '230223', '230224', '230225', '230227', '230229', '230230', '230231', '230281'],
			['230301', '230302', '230303', '230304', '230305', '230306', '230307', '230321', '230381', '230382'],
			['230401', '230402', '230403', '230404', '230405', '230406', '230407', '230421', '230422'],
			['230501', '230502', '230503', '230505', '230506', '230521', '230522', '230523', '230524'],
			['230601', '230602', '230603', '230604', '230605', '230606', '230621', '230622', '230623', '230624'],
			['230701', '230702', '230703', '230704', '230705', '230706', '230707', '230708', '230709', '230710', '230711', '230712', '230713', '230714', '230715', '230716', '230722', '230781'],
			['230801', '230802', '230803', '230804', '230805', '230811', '230822', '230826', '230828', '230833', '230881', '230882'],
			['230901', '230902', '230903', '230904', '230921'],
			['231001', '231002', '231003', '231004', '231005', '231024', '231025', '231081', '231083', '231084', '231085'],
			['231101', '231102', '231121', '231123', '231124', '231181', '231182'],
			['231201', '231202', '231221', '231222', '231223', '231224', '231225', '231226', '231281', '231282', '231283'],
			['232721', '232722', '232723']
		]
	}, {
		loca: '上海市',
		locaCode: '310000',
		locaCity: ['市辖区', '县'],
		locaCityCode: ['310100', '310200'],
		locaCityArea: ['黄浦区', '卢湾区', '徐汇区', '长宁区', '静安区', '普陀区', '闸北区', '虹口区', '杨浦区', '闵行区', '宝山区', '嘉定区', '浦东新区', '金山区', '松江区', '青浦区', '南汇区', '奉贤区', '崇明县'],
		locaCityAreaCode: ['310101', '310103', '310104', '310105', '310106', '310107', '310108', '310109', '310110', '310112', '310113', '310114', '310115', '310116', '310117', '310118', '310119', '310120', '310230']
	}, {
		loca: '江苏省',
		locaCode: '320000',
		locaCity: ['南京市', '无锡市', '徐州市', '常州市', '苏州市', '南通市', '连云港市', '淮安市', '盐城市', '扬州市', '镇江市', '泰州市', '宿迁市'],
		locaCityCode: ['320100', '320200', '320300', '320400', '320500', '320600', '320700', '320800', '320900', '321000', '321100', '321200', '321300'],
		locaCityArea: [
			['市辖区', '玄武区', '白下区', '秦淮区', '建邺区', '鼓楼区', '下关区', '浦口区', '栖霞区', '雨花台区', '江宁区', '六合区', '溧水县', '高淳县'],
			['市辖区', '崇安区', '南长区', '北塘区', '锡山区', '惠山区', '滨湖区', '江阴市', '宜兴市'],
			['市辖区', '鼓楼区', '云龙区', '九里区', '贾汪区', '泉山区', '丰县', '沛县', '铜山县', '睢宁县', '新沂市', '邳州市'],
			['市辖区', '天宁区', '钟楼区', '戚墅堰区', '新北区', '武进区', '溧阳市', '金坛市'],
			['市辖区', '沧浪区', '平江区', '金阊区', '虎丘区', '吴中区', '相城区', '常熟市', '张家港市', '昆山市', '吴江市', '太仓市'],
			['市辖区', '崇川区', '港闸区', '海安县', '如东县', '启东市', '如皋市', '通州市', '海门市'],
			['市辖区', '连云区', '新浦区', '海州区', '赣榆县', '东海县', '灌云县', '灌南县'],
			['市辖区', '清河区', '楚州区', '淮阴区', '清浦区', '涟水县', '洪泽县', '盱眙县', '金湖县'],
			['市辖区', '亭湖区', '盐都区', '响水县', '滨海县', '阜宁县', '射阳县', '建湖县', '东台市', '大丰市'],
			['市辖区', '广陵区', '邗江区', '维扬区', '宝应县', '仪征市', '高邮市', '江都市'],
			['市辖区', '京口区', '润州区', '丹徒区', '丹阳市', '扬中市', '句容市'],
			['市辖区', '海陵区', '高港区', '兴化市', '靖江市', '泰兴市', '姜堰市'],
			['市辖区', '宿城区', '宿豫区', '沭阳县', '泗阳县', '泗洪县']
		],
		locaCityAreaCode: [
			['320101', '320102', '320103', '320104', '320105', '320106', '320107', '320111', '320113', '320114', '320115', '320116', '320124', '320125'],
			['320201', '320202', '320203', '320204', '320205', '320206', '320211', '320281', '320282'],
			['320301', '320302', '320303', '320304', '320305', '320311', '320321', '320322', '320323', '320324', '320381', '320382'],
			['320401', '320402', '320404', '320405', '320411', '320412', '320481', '320482'],
			['320501', '320502', '320503', '320504', '320505', '320506', '320507', '320581', '320582', '320583', '320584', '320585'],
			['320601', '320602', '320611', '320621', '320623', '320681', '320682', '320683', '320684'],
			['320701', '320703', '320705', '320706', '320721', '320722', '320723', '320724'],
			['320801', '320802', '320803', '320804', '320811', '320826', '320829', '320830', '320831'],
			['320901', '320902', '320903', '320921', '320922', '320923', '320924', '320925', '320981', '320982'],
			['321001', '321002', '321003', '321011', '321023', '321081', '321084', '321088'],
			['321101', '321102', '321111', '321112', '321181', '321182', '321183'],
			['321201', '321202', '321203', '321281', '321282', '321283', '321284'],
			['321301', '321302', '321311', '321322', '321323', '321324']
		]
	}, {
		loca: '浙江省',
		locaCode: '330000',
		locaCity: ['杭州市', '宁波市', '温州市', '嘉兴市', '湖州市', '绍兴市', '金华市', '衢州市', '舟山市', '台州市', '丽水市'],
		locaCityCode: ['330100', '330200', '330300', '330400', '330500', '330600', '330700', '330800', '330900', '331000', '331100'],
		locaCityArea: [
			['市辖区', '上城区', '下城区', '江干区', '拱墅区', '西湖区', '滨江区', '萧山区', '余杭区', '桐庐县', '淳安县', '建德市', '富阳市', '临安市'],
			['市辖区', '海曙区', '江东区', '江北区', '北仑区', '镇海区', '鄞州区', '象山县', '宁海县', '余姚市', '慈溪市', '奉化市'],
			['市辖区', '鹿城区', '龙湾区', '瓯海区', '洞头县', '永嘉县', '平阳县', '苍南县', '文成县', '泰顺县', '瑞安市', '乐清市'],
			['市辖区', '秀城区', '秀洲区', '嘉善县', '海盐县', '海宁市', '平湖市', '桐乡市'],
			['市辖区', '吴兴区', '南浔区', '德清县', '长兴县', '安吉县'],
			['市辖区', '越城区', '县', '新昌县', '诸暨市', '上虞市', '嵊州市'],
			['市辖区', '婺城区', '金东区', '武义县', '浦江县', '磐安县', '兰溪市', '义乌市', '东阳市', '永康市'],
			['市辖区', '柯城区', '衢江区', '常山县', '开化县', '龙游县', '江山市'],
			['市辖区', '定海区', '普陀区', '岱山县', '嵊泗县'],
			['市辖区', '椒江区', '黄岩区', '路桥区', '玉环县', '三门县', '天台县', '仙居县', '温岭市', '临海市'],
			['市辖区', '莲都区', '青田县', '缙云县', '遂昌县', '松阳县', '云和县', '庆元县', '景宁畲族自治县', '龙泉市']
		],
		locaCityAreaCode: [
			['330101', '330102', '330103', '330104', '330105', '330106', '330108', '330109', '330110', '330122', '330127', '330182', '330183', '330185'],
			['330201', '330203', '330204', '330205', '330206', '330211', '330212', '330225', '330226', '330281', '330282', '330283'],
			['330301', '330302', '330303', '330304', '330322', '330324', '330326', '330327', '330328', '330329', '330381', '330382'],
			['330401', '330402', '330411', '330421', '330424', '330481', '330482', '330483'],
			['330501', '330502', '330503', '330521', '330522', '330523'],
			['330601', '330602', '330621', '330624', '330681', '330682', '330683'],
			['330701', '330702', '330703', '330723', '330726', '330727', '330781', '330782', '330783', '330784'],
			['330801', '330802', '330803', '330822', '330824', '330825', '330881'],
			['330901', '330902', '330903', '330921', '330922'],
			['331001', '331002', '331003', '331004', '331021', '331022', '331023', '331024', '331081', '331082'],
			['331101', '331102', '331121', '331122', '331123', '331124', '331125', '331126', '331127', '331181']
		]
	}, {
		loca: '福建省',
		locaCode: '350000',
		locaCity: ['福州市', '厦门市', '莆田市', '三明市', '泉州市', '漳州市', '南平市', '龙岩市', '宁德市'],
		locaCityCode: ['350100', '350200', '350300', '350400', '350500', '350600', '350700', '350800', '350900'],
		locaCityArea: [
			['市辖区', '鼓楼区', '台江区', '仓山区', '马尾区', '晋安区', '闽侯县', '连江县', '罗源县', '闽清县', '永泰县', '平潭县', '福清市', '长乐市'],
			['市辖区', '思明区', '海沧区', '湖里区', '集美区', '同安区', '翔安区'],
			['市辖区', '城厢区', '涵江区', '荔城区', '秀屿区', '仙游县'],
			['市辖区', '梅列区', '三元区', '明溪县', '清流县', '宁化县', '大田县', '尤溪县', '沙县', '将乐县', '泰宁县', '建宁县', '永安市'],
			['市辖区', '鲤城区', '丰泽区', '洛江区', '泉港区', '惠安县', '安溪县', '永春县', '德化县', '金门县', '石狮市', '晋江市', '南安市'],
			['市辖区', '芗城区', '龙文区', '云霄县', '漳浦县', '诏安县', '长泰县', '东山县', '南靖县', '平和县', '华安县', '龙海市'],
			['市辖区', '延平区', '顺昌县', '浦城县', '光泽县', '松溪县', '政和县', '邵武市', '武夷山市', '建瓯市', '建阳市'],
			['市辖区', '新罗区', '长汀县', '永定县', '上杭县', '武平县', '连城县', '漳平市'],
			['市辖区', '蕉城区', '霞浦县', '古田县', '屏南县', '寿宁县', '周宁县', '柘荣县', '福安市', '福鼎市']
		],
		locaCityAreaCode: [
			['350101', '350102', '350103', '350104', '350105', '350111', '350121', '350122', '350123', '350124', '350125', '350128', '350181', '350182'],
			['350201', '350203', '350205', '350206', '350211', '350212', '350213'],
			['350301', '350302', '350303', '350304', '350305', '350322'],
			['350401', '350402', '350403', '350421', '350423', '350424', '350425', '350426', '350427', '350428', '350429', '350430', '350481'],
			['350501', '350502', '350503', '350504', '350505', '350521', '350524', '350525', '350526', '350527', '350581', '350582', '350583'],
			['350601', '350602', '350603', '350622', '350623', '350624', '350625', '350626', '350627', '350628', '350629', '350681'],
			['350701', '350702', '350721', '350722', '350723', '350724', '350725', '350781', '350782', '350783', '350784'],
			['350801', '350802', '350821', '350822', '350823', '350824', '350825', '350881'],
			['350901', '350902', '350921', '350922', '350923', '350924', '350925', '350926', '350981', '350982']
		]
	}, {
		loca: '江西省',
		locaCode: '360000',
		locaCity: ['南昌市', '景德镇市', '萍乡市', '九江市', '新余市', '鹰潭市', '赣州市', '吉安市', '宜春市', '抚州市', '上饶市'],
		locaCityCode: ['360100', '360200', '360300', '360400', '360500', '360600', '360700', '360800', '360900', '361000', '361100'],
		locaCityArea: [
			['市辖区', '东湖区', '西湖区', '青云谱区', '湾里区', '青山湖区', '县', '新建县', '安义县', '进贤县'],
			['市辖区', '昌江区', '珠山区', '浮梁县', '乐平市'],
			['市辖区', '安源区', '湘东区', '莲花县', '上栗县', '芦溪县'],
			['市辖区', '庐山区', '浔阳区', '县', '武宁县', '修水县', '永修县', '德安县', '星子县', '都昌县', '湖口县', '彭泽县', '瑞昌市'],
			['市辖区', '渝水区', '分宜县'],
			['市辖区', '月湖区', '余江县', '贵溪市'],
			['市辖区', '章贡区', '赣县', '信丰县', '大余县', '上犹县', '崇义县', '安远县', '龙南县', '定南县', '全南县', '宁都县', '于都县', '兴国县', '会昌县', '寻乌县', '石城县', '瑞金市', '南康市'],
			['市辖区', '吉州区', '青原区', '县', '吉水县', '峡江县', '新干县', '永丰县', '泰和县', '遂川县', '万安县', '安福县', '永新县', '井冈山市'],
			['市辖区', '袁州区', '奉新县', '万载县', '上高县', '宜丰县', '靖安县', '铜鼓县', '丰城市', '樟树市', '高安市'],
			['市辖区', '临川区', '南城县', '黎川县', '南丰县', '崇仁县', '乐安县', '宜黄县', '金溪县', '资溪县', '东乡县', '广昌县'],
			['市辖区', '信州区', '县', '广丰县', '玉山县', '铅山县', '横峰县', '弋阳县', '余干县', '鄱阳县', '万年县', '婺源县', '德兴市']
		],
		locaCityAreaCode: [
			['360101', '360102', '360103', '360104', '360105', '360111', '360121', '360122', '360123', '360124'],
			['360201', '360202', '360203', '360222', '360281'],
			['360301', '360302', '360313', '360321', '360322', '360323'],
			['360401', '360402', '360403', '360421', '360423', '360424', '360425', '360426', '360427', '360428', '360429', '360430', '360481'],
			['360501', '360502', '360521'],
			['360601', '360602', '360622', '360681'],
			['360701', '360702', '360721', '360722', '360723', '360724', '360725', '360726', '360727', '360728', '360729', '360730', '360731', '360732', '360733', '360734', '360735', '360781', '360782'],
			['360801', '360802', '360803', '360821', '360822', '360823', '360824', '360825', '360826', '360827', '360828', '360829', '360830', '360881'],
			['360901', '360902', '360921', '360922', '360923', '360924', '360925', '360926', '360981', '360982', '360983'],
			['361001', '361002', '361021', '361022', '361023', '361024', '361025', '361026', '361027', '361028', '361029', '361030'],
			['361101', '361102', '361121', '361122', '361123', '361124', '361125', '361126', '361127', '361128', '361129', '361130', '361181']
		]
	}, {
		loca: '山东省',
		locaCode: '370000',
		locaCity: ['济南市', '青岛市', '淄博市', '枣庄市', '东营市', '烟台市', '潍坊市', '济宁市', '泰安市', '威海市', '日照市', '莱芜市', '临沂市', '德州市', '聊城市', '滨州市', '荷泽市'],
		locaCityCode: ['370100', '370200', '370300', '370400', '370500', '370600', '370700', '370800', '370900', '371000', '371100', '371200', '371300', '371400', '371500', '371600', '371700'],
		locaCityArea: [
			['市辖区', '历下区', '中区', '槐荫区', '天桥区', '历城区', '长清区', '平阴县', '济阳县', '商河县', '章丘市'],
			['市辖区', '南区', '北区', '四方区', '黄岛区', '崂山区', '李沧区', '城阳区', '胶州市', '即墨市', '平度市', '胶南市', '莱西市'],
			['市辖区', '淄川区', '张店区', '博山区', '临淄区', '周村区', '桓台县', '高青县', '沂源县'],
			['市辖区', '中区', '薛城区', '峄城区', '台儿庄区', '山亭区', '滕州市'],
			['市辖区', '区', '河口区', '垦利县', '利津县', '广饶县'],
			['市辖区', '芝罘区', '福山区', '牟平区', '莱山区', '长岛县', '龙口市', '莱阳市', '莱州市', '蓬莱市', '招远市', '栖霞市', '海阳市'],
			['市辖区', '潍城区', '寒亭区', '坊子区', '奎文区', '临朐县', '昌乐县', '青州市', '诸城市', '寿光市', '安丘市', '高密市', '昌邑市'],
			['市辖区', '中区', '任城区', '微山县', '鱼台县', '金乡县', '嘉祥县', '汶上县', '泗水县', '梁山县', '曲阜市', '兖州市', '邹城市'],
			['市辖区', '泰山区', '岱岳区', '宁阳县', '东平县', '新泰市', '肥城市'],
			['市辖区', '环翠区', '文登市', '荣成市', '乳山市'],
			['市辖区', '东港区', '岚山区', '五莲县', '莒县'],
			['市辖区', '莱城区', '钢城区'],
			['市辖区', '兰山区', '罗庄区', '河东区', '沂南县', '郯城县', '沂水县', '兰陵县', '费县', '平邑县', '莒南县', '蒙阴县', '临沭县'],
			['市辖区', '德城区', '陵县', '宁津县', '庆云县', '临邑县', '齐河县', '平原县', '夏津县', '武城县', '乐陵市', '禹城市'],
			['市辖区', '东昌府区', '阳谷县', '莘县', '茌平县', '东阿县', '冠县', '高唐县', '临清市'],
			['市辖区', '滨城区', '惠民县', '阳信县', '无棣县', '沾化县', '博兴县', '邹平县'],
			['市辖区', '牡丹区', '曹县', '单县', '成武县', '巨野县', '郓城县', '鄄城县', '定陶县', '东明县']
		],
		locaCityAreaCode: [
			['370101', '370102', '370103', '370104', '370105', '370112', '370113', '370124', '370125', '370126', '370181'],
			['370201', '370202', '370203', '370205', '370211', '370212', '370213', '370214', '370281', '370282', '370283', '370284', '370285'],
			['370301', '370302', '370303', '370304', '370305', '370306', '370321', '370322', '370323'],
			['370401', '370402', '370403', '370404', '370405', '370406', '370481'],
			['370501', '370502', '370503', '370521', '370522', '370523'],
			['370601', '370602', '370611', '370612', '370613', '370634', '370681', '370682', '370683', '370684', '370685', '370686', '370687'],
			['370701', '370702', '370703', '370704', '370705', '370724', '370725', '370781', '370782', '370783', '370784', '370785', '370786'],
			['370801', '370802', '370811', '370826', '370827', '370828', '370829', '370830', '370831', '370832', '370881', '370882', '370883'],
			['370901', '370902', '370903', '370921', '370923', '370982', '370983'],
			['371001', '371002', '371081', '371082', '371083'],
			['371101', '371102', '371103', '371121', '371122'],
			['371201', '371202', '371203'],
			['371301', '371302', '371311', '371312', '371321', '371322', '371323', '371324', '371325', '371326', '371327', '371328', '371329'],
			['371401', '371402', '371421', '371422', '371423', '371424', '371425', '371426', '371427', '371428', '371481', '371482'],
			['371501', '371502', '371521', '371522', '371523', '371524', '371525', '371526', '371581'],
			['371601', '371602', '371621', '371622', '371623', '371624', '371625', '371626'],
			['371701', '371702', '371721', '371722', '371723', '371724', '371725', '371726', '371727', '371728']
		]
	}, {
		loca: '河南省',
		locaCode: '410000',
		locaCity: ['郑州市', '开封市', '洛阳市', '平顶山市', '安阳市', '鹤壁市', '新乡市', '焦作市', '濮阳市', '许昌市', '漯河市', '三门峡市', '南阳市', '商丘市', '信阳市', '周口市', '驻马店市'],
		locaCityCode: ['410100', '410200', '410300', '410400', '410500', '410600', '410700', '410800', '410900', '411000', '411100', '411200', '411300', '411400', '411500', '411600', '411700'],
		locaCityArea: [
			['市辖区', '中原区', '二七区', '管城回族区', '金水区', '上街区', '惠济区', '中牟县', '巩义市', '荥阳市', '新密市', '新郑市', '登封市'],
			['市辖区', '龙亭区', '顺河回族区', '鼓楼区', '禹王台区', '金明区', '杞县', '通许县', '尉氏县', '县', '兰考县'],
			['市辖区', '老城区', '西工区', '瀍河回族区', '涧西区', '吉利区', '洛龙区', '孟津县', '新安县', '栾川县', '嵩县', '汝阳县', '宜阳县', '洛宁县', '伊川县', '偃师市'],
			['市辖区', '新华区', '卫东区', '石龙区', '湛河区', '宝丰县', '叶县', '鲁山县', '郏县', '舞钢市', '汝州市'],
			['市辖区', '文峰区', '北关区', '殷都区', '龙安区', '县', '汤阴县', '滑县', '内黄县', '林州市'],
			['市辖区', '鹤山区', '山城区', '淇滨区', '浚县', '淇县'],
			['市辖区', '红旗区', '卫滨区', '凤泉区', '牧野区', '县', '获嘉县', '原阳县', '延津县', '封丘县', '长垣县', '卫辉市', '辉县市'],
			['市辖区', '解放区', '中站区', '马村区', '山阳区', '修武县', '博爱县', '武陟县', '温县', '济源市', '沁阳市', '孟州市'],
			['市辖区', '华龙区', '清丰县', '南乐县', '范县', '台前县', '县'],
			['市辖区', '魏都区', '县', '鄢陵县', '襄城县', '禹州市', '长葛市'],
			['市辖区', '源汇区', '郾城区', '召陵区', '舞阳县', '临颖县'],
			['市辖区', '湖滨区', '渑池县', '陕县', '卢氏县', '义马市', '灵宝市'],
			['市辖区', '宛城区', '卧龙区', '南召县', '方城县', '西峡县', '镇平县', '内乡县', '淅川县', '社旗县', '唐河县', '新野县', '桐柏县', '邓州市'],
			['市辖区', '梁园区', '睢阳区', '民权县', '睢县', '宁陵县', '柘城县', '虞城县', '夏邑县', '永城市'],
			['市辖区', '浉河区', '平桥区', '罗山县', '光山县', '新县', '商城县', '固始县', '潢川县', '淮滨县', '息县'],
			['市辖区', '川汇区', '扶沟县', '西华县', '商水县', '沈丘县', '郸城县', '淮阳县', '太康县', '鹿邑县', '项城市'],
			['市辖区', '驿城区', '西平县', '上蔡县', '平舆县', '正阳县', '确山县', '泌阳县', '汝南县', '遂平县', '新蔡县']
		],
		locaCityAreaCode: [
			['410101', '410102', '410103', '410104', '410105', '410106', '410108', '410122', '410181', '410182', '410183', '410184', '410185'],
			['410201', '410202', '410203', '410204', '410205', '410211', '410221', '410222', '410223', '410224', '410225'],
			['410301', '410302', '410303', '410304', '410305', '410306', '410307', '410322', '410323', '410324', '410325', '410326', '410327', '410328', '410329', '410381'],
			['410401', '410402', '410403', '410404', '410411', '410421', '410422', '410423', '410425', '410481', '410482'],
			['410501', '410502', '410503', '410505', '410506', '410522', '410523', '410526', '410527', '410581'],
			['410601', '410602', '410603', '410611', '410621', '410622'],
			['410701', '410702', '410703', '410704', '410711', '410721', '410724', '410725', '410726', '410727', '410728', '410781', '410782'],
			['410801', '410802', '410803', '410804', '410811', '410821', '410822', '410823', '410825', '410881', '410882', '410883'],
			['410901', '410902', '410922', '410923', '410926', '410927', '410928'],
			['411001', '411002', '411023', '411024', '411025', '411081', '411082'],
			['411101', '411102', '411103', '411104', '411121', '411122'],
			['411201', '411202', '411221', '411222', '411224', '411281', '411282'],
			['411301', '411302', '411303', '411321', '411322', '411323', '411324', '411325', '411326', '411327', '411328', '411329', '411330', '411381'],
			['411401', '411402', '411403', '411421', '411422', '411423', '411424', '411425', '411426', '411481'],
			['411501', '411502', '411503', '411521', '411522', '411523', '411524', '411525', '411526', '411527', '411528'],
			['411601', '411602', '411621', '411622', '411623', '411624', '411625', '411626', '411627', '411628', '411681'],
			['411701', '411702', '411721', '411722', '411723', '411724', '411725', '411726', '411727', '411728', '411729']
		]
	}, {
		loca: '湖北省',
		locaCode: '420000',
		locaCity: ['武汉市', '黄石市', '十堰市', '宜昌市', '襄樊市', '鄂州市', '荆门市', '孝感市', '荆州市', '黄冈市', '咸宁市', '随州市', '恩施土家族苗族自治州', '省直辖行政单位'],
		locaCityCode: ['420100', '420200', '420300', '420500', '420600', '420700', '420800', '420900', '421000', '421100', '421200', '421300', '422800', '429000'],
		locaCityArea: [
			['市辖区', '江岸区', '江汉区', '硚口区', '汉阳区', '武昌区', '青山区', '洪山区', '东西湖区', '汉南区', '蔡甸区', '江夏区', '黄陂区', '新洲区'],
			['市辖区', '港区', '西塞山区', '下陆区', '铁山区', '阳新县', '大冶市'],
			['市辖区', '茅箭区', '张湾区', '郧县', '郧西县', '竹山县', '竹溪县', '房县', '丹江口市'],
			['市辖区', '西陵区', '伍家岗区', '点军区', '猇亭区', '夷陵区', '远安县', '兴山县', '秭归县', '长阳土家族自治县', '五峰土家族自治县', '宜都市', '当阳市', '枝江市'],
			['市辖区', '襄城区', '樊城区', '襄阳区', '南漳县', '谷城县', '保康县', '老河口市', '枣阳市', '宜城市'],
			['市辖区', '梁子湖区', '华容区', '鄂城区'],
			['市辖区', '东宝区', '掇刀区', '京山县', '沙洋县', '钟祥市'],
			['市辖区', '孝南区', '孝昌县', '大悟县', '云梦县', '应城市', '安陆市', '汉川市'],
			['市辖区', '沙市区', '区', '公安县', '监利县', '江陵县', '石首市', '洪湖市', '松滋市'],
			['市辖区', '黄州区', '团风县', '红安县', '罗田县', '英山县', '浠水县', '蕲春县', '黄梅县', '麻城市', '武穴市'],
			['市辖区', '咸安区', '嘉鱼县', '通城县', '崇阳县', '通山县', '赤壁市'],
			['市辖区', '曾都区', '广水市'],
			['市', '利川市', '建始县', '巴东县', '宣恩县', '咸丰县', '来凤县', '鹤峰县'],
			['仙桃市', '潜江市', '天门市', '神农架林区']
		],
		locaCityAreaCode: [
			['420101', '420102', '420103', '420104', '420105', '420106', '420107', '420111', '420112', '420113', '420114', '420115', '420116', '420117'],
			['420201', '420202', '420203', '420204', '420205', '420222', '420281'],
			['420301', '420302', '420303', '420321', '420322', '420323', '420324', '420325', '420381'],
			['420501', '420502', '420503', '420504', '420505', '420506', '420525', '420526', '420527', '420528', '420529', '420581', '420582', '420583'],
			['420601', '420602', '420606', '420607', '420624', '420625', '420626', '420682', '420683', '420684'],
			['420701', '420702', '420703', '420704'],
			['420801', '420802', '420804', '420821', '420822', '420881'],
			['420901', '420902', '420921', '420922', '420923', '420981', '420982', '420984'],
			['421001', '421002', '421003', '421022', '421023', '421024', '421081', '421083', '421087'],
			['421101', '421102', '421121', '421122', '421123', '421124', '421125', '421126', '421127', '421181', '421182'],
			['421201', '421202', '421221', '421222', '421223', '421224', '421281'],
			['421301', '421302', '421381'],
			['422801', '422802', '422822', '422823', '422825', '422826', '422827', '422828'],
			['429004', '429005', '429006', '429021']
		]
	}, {
		loca: '广东省',
		locaCode: '440000',
		locaCity: ['广州市', '韶关市', '深圳市', '珠海市', '汕头市', '佛山市', '江门市', '湛江市', '茂名市', '肇庆市', '惠州市', '梅州市', '汕尾市', '河源市', '阳江市', '清远市', '东莞市', '中山市', '潮州市', '揭阳市', '云浮市'],
		locaCityCode: ['440100', '440200', '440300', '440400', '440500', '440600', '440700', '440800', '440900', '441200', '441300', '441400', '441500', '441600', '441700', '441800', '441900', '442000', '445100', '445200', '445300'],
		locaCityArea: [
			['市辖区', '荔湾区', '越秀区', '海珠区', '天河区', '白云区', '黄埔区', '番禺区', '花都区', '南沙区', '萝岗区', '增城市', '从化市'],
			['市辖区', '武江区', '浈江区', '曲江区', '始兴县', '仁化县', '翁源县', '乳源瑶族自治县', '新丰县', '乐昌市', '南雄市'],
			['市辖区', '罗湖区', '福田区', '南山区', '宝安区', '龙岗区', '盐田区'],
			['市辖区', '香洲区', '斗门区', '金湾区'],
			['市辖区', '龙湖区', '金平区', '濠江区', '潮阳区', '潮南区', '澄海区', '南澳县'],
			['市辖区', '禅城区', '南海区', '顺德区', '三水区', '高明区'],
			['市辖区', '蓬江区', '江海区', '新会区', '台山市', '开平市', '鹤山市', '恩平市'],
			['市辖区', '赤坎区', '霞山区', '坡头区', '麻章区', '遂溪县', '徐闻县', '廉江市', '雷州市', '吴川市'],
			['市辖区', '茂南区', '茂港区', '电白县', '高州市', '化州市', '信宜市'],
			['市辖区', '端州区', '鼎湖区', '广宁县', '怀集县', '封开县', '德庆县', '高要市', '四会市'],
			['市辖区', '惠城区', '惠阳区', '博罗县', '惠东县', '龙门县'],
			['市辖区', '梅江区', '梅县', '大埔县', '丰顺县', '五华县', '平远县', '蕉岭县', '兴宁市'],
			['市辖区', '城区', '海丰县', '陆河县', '陆丰市'],
			['市辖区', '源城区', '紫金县', '龙川县', '连平县', '和平县', '东源县'],
			['市辖区', '江城区', '阳西县', '阳东县', '阳春市'],
			['市辖区', '清城区', '佛冈县', '阳山县', '连山壮族瑶族自治县', '连南瑶族自治县', '清新县', '英德市', '连州市'],
			[''],
			[''],
			['潮州市辖区', '潮州湘桥区', '潮州潮安县', '潮州饶平县'],
			['市辖区', '榕城区', '揭东县', '揭西县', '惠来县', '普宁市'],
			['市辖区', '云城区', '新兴县', '郁南县', '云安县', '罗定市']
		],
		locaCityAreaCode: [
			['440101', '440103', '440104', '440105', '440106', '440111', '440112', '440113', '440114', '440115', '440116', '440183', '440184'],
			['440201', '440203', '440204', '440205', '440222', '440224', '440229', '440232', '440233', '440281', '440282'],
			['440301', '440303', '440304', '440305', '440306', '440307', '440308'],
			['440401', '440402', '440403', '440404'],
			['440501', '440507', '440511', '440512', '440513', '440514', '440515', '440523'],
			['440601', '440604', '440605', '440606', '440607', '440608'],
			['440701', '440703', '440704', '440705', '440781', '440783', '440784', '440785'],
			['440801', '440802', '440803', '440804', '440811', '440823', '440825', '440881', '440882', '440883'],
			['440901', '440902', '440903', '440923', '440981', '440982', '440983'],
			['441201', '441202', '441203', '441223', '441224', '441225', '441226', '441283', '441284'],
			['441301', '441302', '441303', '441322', '441323', '441324'],
			['441401', '441402', '441421', '441422', '441423', '441424', '441426', '441427', '441481'],
			['441501', '441502', '441521', '441523', '441581'],
			['441601', '441602', '441621', '441622', '441623', '441624', '441625'],
			['441701', '441702', '441721', '441723', '441781'],
			['441801', '441802', '441821', '441823', '441825', '441826', '441827', '441881', '441882'],
			['441910'],
			['442010'],
			['445101', '445102', '445121', '445122'],
			['445201', '445202', '445221', '445222', '445224', '445281'],
			['445301', '445302', '445321', '445322', '445323', '445381']
		]
	}, ];

	Sinosoft.apply(Sinosoft, {
		/**
		 * 用法：
		 * province		省对象	必传
		 * city			市对象	必传
		 * area			区对象	必传
		 * _province	省代码	默认-1
		 * _city		市代码	默认-1
		 * _area		区代码	默认-1
		 */
		initCitySelector: function(province, city, area, _province, _city, _area) {
			console.log("_province: " + _province + ", _city: " + _city + ", _area: " + _area);

			var province_select,
				city_select,
				area_select;

			province_select = province;
			city_select = city;
			area_select = area;

			if (jQuery.isEmptyObject(_province)) {
				_province = '-1';
			}

			if (jQuery.isEmptyObject(_city)) {
				_city = '-1';
			}
			if (jQuery.isEmptyObject(_area)) {
				_area = '-1';
			}

			initSelectData();

			function p_select() {
				var isSelect = 0;
				var province = province_select.find("option:selected").val();
				for (var i = 0; i < where.length; i++) {
					if (where[i].locaCode == province) {
						if (province == '110000' || province == '120000' || province == '310000' || province == '500000') {
							city_select.hide();
							province_select.css({
								"width": "48%",
								"margin-right": "4%"
							});
							city_select.css("width", "48%");
							area_select.css("width", "48%");
							for (var j = 0; j < where.length; j++) {
								if (where[j].locaCode == province) {
									var areaOpts = '';
									var area_list = where[j].locaCityArea;
									var areaCode_list = where[j].locaCityAreaCode;
									var length = area_list.length;
									for (var k = 0; k < length; k++) {
										var opt = '<option value=' + areaCode_list[k] + '>' + area_list[k] + '</option>';
										if (areaCode_list[k] == _city) {
											isSelect++;
											opt = '<option value=' + areaCode_list[k] + ' selected=true>' + area_list[k] + '</option>';
										}
										areaOpts += opt;
									}
									area_select.empty().html(areaOpts);
									break;
								}
							}
						} else {
							province_select.css({
								"width": "32%",
								"margin-right": "2%"
							});
							city_select.css({
								"width": "32%",
								"margin-right": "2%"
							});
							area_select.css("width", "32%");
							city_select.show();
							var cityOpts = '';
							var city_list = where[i].locaCity;
							var length = city_list.length;
							for (var j = 0; j < length; j++) {
								var opt = '<option value=' + where[i].locaCityCode[j] + '>' + city_list[j] + '</option>';
								if (where[i].locaCityCode[j] == _city) {
									isSelect++;
									opt = '<option value=' + where[i].locaCityCode[j] + ' selected=true>' + city_list[j] + '</option>';
								}
								cityOpts += opt;
							}
							city_select.empty().html(cityOpts);
							break;
						}
					}
				}
				if (province == '110000' || province == '120000' || province == '310000' || province == '500000') {
					if (isSelect == 0) {
						jQuery(area_select).get(0).options[0].selected = true;
					}
					initCity(province);
					a_select(area_select.val());
				} else {
					if (isSelect == 0) {
						jQuery(city_select).get(0).options[0].selected = true;
					}
					c_select(city_select.val());
				}
				province_select.parent().find("input[id='" + province_select.attr("id") + "']").val(province_select.find("option:selected").text());
			}

			function c_select(_citySelect) {
				//console.log("c_select()...");
				var isSelect = 0;
				var city = _citySelect;
				if (jQuery.isEmptyObject(city)) {
					city = _city;
				}
				for (var i = 0; i < where.length; i++) {
					for (var j = 0; j < where[i].locaCityCode.length; j++) {
						if (where[i].locaCityCode[j] == city) {
							var areaOpts = '';
							var area_list = where[i].locaCityArea[j];
							var areaCode_list = where[i].locaCityAreaCode[j];
							var length = area_list.length;
							for (var k = 0; k < length; k++) {
								if (area_list[k] != '市辖区') {
									var opt = '<option value=' + areaCode_list[k] + '>' + area_list[k] + '</option>';
									if (areaCode_list[k] == _area) {
										isSelect++;
										opt = '<option value=' + areaCode_list[k] + ' selected=true>' + area_list[k] + '</option>';
									}
									areaOpts += opt;
								}
							}
							area_select.empty().html(areaOpts);
							break;
						}
					}
				}
				if (isSelect == 0) {
					jQuery(area_select).get(0).options[0].selected = true;
				}
				city_select.parent().find("input[id='" + city_select.attr("id") + "']").val(city_select.find("option:selected").text());
				area_select.parent().find("input[id='" + area_select.attr("id") + "']").val(area_select.find("option:selected").text());
			}

			//县区定制处理
			function a_select(_areaSelect) {
				var province = province_select.find("option:selected").val();
				var area = area_select.find("option:selected").val();
				if (province == '110000') {
					jQuery(city_select).get(0).options[0].selected = true;
				} else if (area == '310000') {
					jQuery(city_select).get(0).options[0].selected = true;
				}
				if (area == '110228' || area == '110229') {
					jQuery(city_select).get(0).options[1].selected = true;
				} else if (area == '310230') {
					jQuery(city_select).get(0).options[1].selected = true;
				}
				city_select.parent().find("input[id='" + city_select.attr("id") + "']").val(city_select.find("option:selected").text());
				area_select.parent().find("input[id='" + area_select.attr("id") + "']").val(area_select.find("option:selected").text());
			}

			function initCity(province) {
				//console.log("initCity("+province+")...");
				for (var i = 0; i < where.length; i++) {
					if (where[i].locaCode == province) {
						var cityOpts = '';
						var city_list = where[i].locaCity;
						var length = city_list.length;
						for (var j = 0; j < length; j++) {
							var opt = '<option value=' + where[i].locaCityCode[j] + '>' + city_list[j] + '</option>';
							if (where[i].locaCityCode[j] == _city) {
								opt = '<option value=' + where[i].locaCityCode[j] + ' selected=true>' + city_list[j] + '</option>';
							}
							cityOpts += opt;
						}
						city_select.empty().html(cityOpts);
						break;
					}
				}
				initArea(province);
				city_select.parent().find("input[id='" + city_select.attr("id") + "']").val(city_select.find("option:selected").text());
			}

			function initArea(province) {
				//console.log("initArea("+province+")...");
				for (var i = 0; i < where.length; i++) {
					if (where[i].locaCode == province) {
						if (province == '110000' || province == '120000' || province == '310000' || province == '500000') {
							//								city_select.hide();
							for (var j = 0; j < where.length; j++) {
								if (where[j].locaCode == province) {
									var areaOpts = '';
									var area_list = where[j].locaCityArea;
									var areaCode_list = where[j].locaCityAreaCode;
									var length = area_list.length;
									for (var k = 0; k < length; k++) {
										var opt = '<option value=' + areaCode_list[k] + '>' + area_list[k] + '</option>';
										if (areaCode_list[k] == _area) {
											opt = '<option value=' + areaCode_list[k] + ' selected=true>' + area_list[k] + '</option>';
										}
										areaOpts += opt;
									}
									area_select.empty().html(areaOpts);
									break;
								}
							}
						}
					}
				}
			}

			function initSelectData() {
				//console.log("initSelectData()...");
				var provinceOpts = '';
				var length = where.length;
				for (var k = 0; k < length; k++) {
					var opt = '<option value=' + where[k].locaCode + '>' + where[k].loca + '</option>';
					if (where[k].locaCode == _province) {
						opt = '<option value=' + where[k].locaCode + ' selected=true>' + where[k].loca + '</option>';
					}
					provinceOpts += opt;
				}
				province_select.empty();
				province_select.html(provinceOpts);
				p_select();
				province_select.change(function() {
					p_select();
				});

				city_select.change(function() {
					c_select(city_select.val());
				});

				area_select.change(function() {
					a_select(area_select.val());
				});
			}
		}
	});
})();